ci-news/app/Controllers/MahasiswaController.php

SELECT *
FROM `mahasiswa`
---
    public function index()
    {
        $model = new MahasiswaModel();

        $keyword = $this->request->getGet('keyword');

        if ($keyword) {
            $data_mahasiswa = $model->search($keyword);
        } else {

            $data_mahasiswa = $model->findAll();

SELECT *
FROM `mahasiswa`
WHERE `mahasiswa`.`id` = '1'
---
    public function edit($id)
    {
        $model = new MahasiswaModel();

        $data = [
            'title' => 'Edit Data Mahasiswa',
            'mahasiswa' => $model->find($id)
        ];