ci-news/app/Models/MahasiswaModel.php

SELECT *
FROM `mahasiswa`
WHERE `mahasiswa`.`id` = '1'
---
    public function getMahasiswaById($id)
    {
        return $this->find($id);